In [4]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 
'n1': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'n2': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
data = pd.DataFrame(exam_data, index = labels)
print(data)

        name    n1  n2 qualify
a  Anastasia  12.5   1     yes
b       Dima   9.0   3      no
c  Katherine  16.5   2     yes
d      James   NaN   3      no
e      Emily   9.0   2      no
f    Michael  20.0   3     yes
g    Matthew  14.5   1     yes
h      Laura   NaN   1      no
i      Kevin   8.0   2      no
j      Jonas  19.0   1     yes

In [73]:
df1 = pd.DataFrame([[1,2,3,5],[np.nan,2,3,4],[np.nan,3,2,np.nan],[np.nan,np.nan,np.nan,np.nan]],columns=["Exam","Exam","Exam","Exam"])
df1

   Exam  Exam  Exam  Exam
0   1.0   2.0   3.0   5.0
1   NaN   2.0   3.0   4.0
2   NaN   3.0   2.0   NaN
3   NaN   NaN   NaN   NaN

In [74]:
df1.columns =["Exam1","Exam2","address","Exam3"]
df1

   Exam1  Exam2  address  Exam3
0    1.0    2.0      3.0    5.0
1    NaN    2.0      3.0    4.0
2    NaN    3.0      2.0    NaN
3    NaN    NaN      NaN    NaN

In [75]:
a=["A","B","C","D"]
df1.reindex(a)

   Exam1  Exam2  address  Exam3
A    NaN    NaN      NaN    NaN
B    NaN    NaN      NaN    NaN
C    NaN    NaN      NaN    NaN
D    NaN    NaN      NaN    NaN

In [78]:
df1.reset_index(inplace=True)

In [79]:
df1

   level_0  index  Exam1  Exam2  address  Exam3
0        0      0    1.0    2.0      3.0    5.0
1        1      1    NaN    2.0      3.0    4.0
2        2      2    NaN    3.0      2.0    NaN
3        3      3    NaN    NaN      NaN    NaN

In [80]:
df1.drop(["index"],axis=1,inplace=True)
df1

   level_0  Exam1  Exam2  address  Exam3
0        0    1.0    2.0      3.0    5.0
1        1    NaN    2.0      3.0    4.0
2        2    NaN    3.0      2.0    NaN
3        3    NaN    NaN      NaN    NaN

In [81]:
df1.drop(["level_0"],axis=1,inplace=True)
df1

   Exam1  Exam2  address  Exam3
0    1.0    2.0      3.0    5.0
1    NaN    2.0      3.0    4.0
2    NaN    3.0      2.0    NaN
3    NaN    NaN      NaN    NaN

In [89]:
b=df1.fillna(5)
b

   Exam1  Exam2  address  Exam3
0    1.0    2.0      3.0    5.0
1    5.0    2.0      3.0    4.0
2    5.0    3.0      2.0    5.0
3    5.0    5.0      5.0    5.0

In [100]:
c=b.applymap(int)

In [99]:
b

   Exam1  Exam2  address  Exam3
0    1.0    2.0      3.0    5.0
1    5.0    2.0      3.0    4.0
2    5.0    3.0      2.0    5.0
3    5.0    5.0      5.0    5.0

In [101]:
c

   Exam1  Exam2  address  Exam3
0      1      2        3      5
1      5      2        3      4
2      5      3        2      5
3      5      5        5      5

In [104]:
c.astype(float)

   Exam1  Exam2  address  Exam3
0    1.0    2.0      3.0    5.0
1    5.0    2.0      3.0    4.0
2    5.0    3.0      2.0    5.0
3    5.0    5.0      5.0    5.0

In [123]:
c

   Exam1  Exam2  address  Exam3
0      1      2        3      5
1      5      2        3      4
2      5      3        2      5
3      5      5        5      5

In [153]:
c.at[2,:]=float(c.at[2,:])

TypeError: unhashable type: 'slice'

In [162]:
c.at[2,"Exam2"]=float(c.at[2,"Exam2"])

In [164]:
c

   Exam1  Exam2  address  Exam3
0      1      2        3      5
1      5      2        3      4
2      5      3        2      5
3      5      5        5      5

In [163]:
type(c.at[2,"Exam2"])

numpy.int64

In [165]:
row_index = 2

# Loop through the columns and change the data type of row values
for column in c.columns:
    c.at[row_index, column] = float(c.at[row_index, column])

# Display the modified DataFrame
print("After data type change:")
print(c)

After data type change:
   Exam1  Exam2  address  Exam3
0      1      2        3      5
1      5      2        3      4
2      5      3        2      5
3      5      5        5      5

In [167]:
import pandas as pd

# Create a sample DataFrame
data = {'Name': [1,2,3],
        'Age': [25, 30, 35],
        'Salary': [50000, 60000, 70000]}
df = pd.DataFrame(data)

# Display the initial DataFrame
print("Before data type change:")
print(df)

# Specify the row index you want to modify
row_index = 1

# Loop through the columns and change the data type of row values
for column in df.columns:
    df.at[row_index, column] = float(df.at[row_index, column])

# Display the modified DataFrame
print("After data type change:")
print(df)

Before data type change:
   Name  Age  Salary
0     1   25   50000
1     2   30   60000
2     3   35   70000
After data type change:
   Name  Age  Salary
0     1   25   50000
1     2   30   60000
2     3   35   70000

In [168]:
import pandas as pd

# Create a sample DataFrame
data = {'Name': ['John', 'Jane', 'Steve'],
        'Age': [25, 30, 35],
        'Salary': [50000, 60000, 70000]}
df = pd.DataFrame(data)

# Display the initial DataFrame
print("Before data type change:")
print(df)

# Specify the row index and column name you want to modify
row_index = 1
column_name = 'Age'

# Change the data type of the specific value in the row
df.loc[row_index, column_name] = float(df.loc[row_index, column_name])

# Display the modified DataFrame
print("After data type change:")
print(df)

Before data type change:
    Name  Age  Salary
0   John   25   50000
1   Jane   30   60000
2  Steve   35   70000
After data type change:
    Name  Age  Salary
0   John   25   50000
1   Jane   30   60000
2  Steve   35   70000